# FamilyNamePseudoParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FamilyNamePseudoParam Property
ParameterTypeId Class See Also
---
"Family"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FamilyNamePseudoParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FamilyNamePseudoParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FamilyNamePseudoParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace